
![png](Movies-ERD.png)

In [1]:
import pymysql
import pandas as pd
from urllib.parse import quote_plus
from sqlalchemy.types import *
from sqlalchemy.engine import create_engine
from sqlalchemy_utils import create_database, database_exists
pymysql.install_as_MySQLdb()

In [2]:
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [3]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [4]:
q=''' DESCRIBE genres;'''
describe = pd.read_sql(q, engine)
describe

        Field         Type Null  Key Default Extra
0    genre_id          int   NO  PRI    None
1  genre_name  varchar(45)  YES         None

In [5]:
# Prepare title_basics dataframe for the database
tb_dtypes_dict = {'tconst': VARCHAR(10),
                  'primaryTitle': VARCHAR(242),
                  'startYear': INTEGER(),
                  'runtimeMinutes': INTEGER()}

In [6]:
title_basics = pd.read_csv('Data/basic.csv')
title_basics.info()
title_basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [7]:
title_basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [8]:
title_basics = title_basics.drop (columns = ['titleType', 'originalTitle', 'isAdult','endYear', 'genres'])
title_basics.columns

Index(['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes'], dtype='object')

In [9]:
title_basics= title_basics[['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes']]

In [10]:
title_basics.head()

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [11]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   primaryTitle    86979 non-null  object
 2   startYear       86979 non-null  float64
 3   runtimeMinutes  86979 non-null  int64
dtypes: float64(1), int64(1), object(2)
memory usage: 2.7+ MB

In [12]:
q = '''
describe title_basics;'''
describe_tb = pd.read_sql(q, conn)
describe_tb

            Field          Type Null  Key Default Extra
0          tconst   varchar(10)   NO  PRI    None
1    primaryTitle  varchar(242)  YES         None
2       startYear           int  YES         None
3  runtimeMinutes           int  YES         None

In [13]:
#title_basics.to_sql('title_basics', engine, index = False, if_exists = 'append')

In [14]:
# Calculate max string len for object cols
tconst_length = title_basics['tconst'].fillna('').map(len).max()
tconst_length

10

In [15]:
# Calculate max string len for object cols
ptitle_length = title_basics['primaryTitle'].fillna('').map(len).max()
ptitle_length

242

In [16]:
ratings = pd.read_csv('Data/ratings.csv')
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [17]:
q = '''
describe ratings;'''
describe_r = pd.read_sql(q, conn)
describe_r

           Field         Type Null  Key Default Extra
0         tconst  varchar(10)   NO  PRI    None
1  averageRating  varchar(45)  YES         None
2       numVotes          int  YES         None

In [18]:
#ratings.to_sql("ratings",engine,index=False, if_exists='append')

In [19]:
q = '''SHOW TABLES;'''
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres

In [20]:
# confirm the data has been added
q = """SELECT * FROM title_basics LIMIT 5;"""
pd.read_sql(q,conn)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [21]:
# confirm the data has been added
q = """SELECT * FROM ratings LIMIT 5;"""
pd.read_sql(q,conn)

      tconst averageRating  numVotes
0  tt0035423           6.4     87153
1  tt0062336           6.4       175
2  tt0069049           6.7      7754
3  tt0088751           5.2       336
4  tt0096056           5.6       846